particle-iot/device-os/hal/src/stm32f2xx/usart_hal.c
uint8_t calculateWordLength(uint32_t config, uint8_t noparity) {
    // STM32F2 USARTs support only 8-bit or 9-bit communication, however
    // the parity bit is included in the total word length, so for 8E1 mode
    // the total word length would be 9 bits.
    uint8_t wlen = 0;
    switch (config & SERIAL_DATA_BITS) {
        case SERIAL_DATA_BITS_7: {
            wlen += 7;
            break;
        }
        case SERIAL_DATA_BITS_8: {
            wlen += 8;
            break;
        }
        case SERIAL_DATA_BITS_9: {
            wlen += 9;
            break;
        }
    }

    if ((config & SERIAL_PARITY) && !noparity) {
        wlen++;
    }

    if (wlen > 9 || wlen < (noparity ? 7 : 8)) {
        wlen = 0;
    }

    return wlen;
}

uint32_t calculateDataBitsMask(uint32_t config) {
    return (1 << calculateWordLength(config, 1)) - 1;
}

bool validateConfig(hal_usart_interface_t serial, uint32_t config) {
    // Total word length should be either 8 or 9 bits
    if (calculateWordLength(config, 0) == 0) {
        return false;
    }
    // Either No, Even or Odd parity
    if ((config & SERIAL_PARITY) == (SERIAL_PARITY_EVEN | SERIAL_PARITY_ODD)) {
        return false;
    }
    if ((config & SERIAL_HALF_DUPLEX) && (config & LIN_MODE)) {
        return false;
    }

    if (config & LIN_MODE) {
        // Either Master or Slave mode
        // Break detection can still be enabled in both Master and Slave modes
        if ((config & LIN_MODE_MASTER) && (config & LIN_MODE_SLAVE)) {
            return false;
        }
        switch (config & LIN_BREAK_BITS) {
            case LIN_BREAK_13B:
            case LIN_BREAK_10B:
            case LIN_BREAK_11B: {
                break;
            }
            default: {
                return false;
            }
        }
    }

    if ((config & SERIAL_FLOW_CONTROL) && !hardwareFlowControlSupported(serial)) {
        return false;
    }

    return true;
}

void configureTransmitReceive(hal_usart_interface_t serial, uint8_t transmit, uint8_t receive) {
    uint32_t toset = 0;
    if (transmit) {
        toset |= ((uint32_t)USART_CR1_TE);
    }
    if (receive) {
        toset |= ((uint32_t)USART_CR1_RE);
    }
    uint32_t tmp = usartMap[serial]->peripheral->CR1;
    if ((tmp & ((uint32_t)(USART_CR1_TE | USART_CR1_RE))) != toset) {
        tmp &= ~((uint32_t)(USART_CR1_TE | USART_CR1_RE));
        tmp |= toset;
        usartMap[serial]->peripheral->CR1 = tmp;
    }
}

void configurePinsMode(hal_usart_interface_t serial, uint32_t config) {
    if ((config & SERIAL_HALF_DUPLEX) == 0) {
        // Full duplex with push-pull
        HAL_Pin_Mode(usartMap[serial]->rx_pin, AF_OUTPUT_PUSHPULL);
        HAL_Pin_Mode(usartMap[serial]->tx_pin, AF_OUTPUT_PUSHPULL);
    } else if ((config & SERIAL_OPEN_DRAIN)) {
        // Half-duplex with open drain
        HAL_Pin_Mode(usartMap[serial]->rx_pin, INPUT);
        HAL_Pin_Mode(usartMap[serial]->tx_pin, AF_OUTPUT_DRAIN);
    } else {
        // Half-duplex with push-pull
        /* RM0033 24.3.10:
         * The TX pin is always released when no data is transmitted. Thus, it acts as a standard
         * I/O in idle or in reception. It means that the I/O must be configured so that TX is
         * configured as floating input (or output high open-drain) when not driven by the USART
         */
        HAL_Pin_Mode(usartMap[serial]->rx_pin, INPUT);
        HAL_Pin_Mode(usartMap[serial]->tx_pin, AF_OUTPUT_PUSHPULL);
        if (config & SERIAL_TX_PULL_UP) {
            // We ought to allow enabling pull-up or pull-down through HAL somehow
            Hal_Pin_Info* PIN_MAP = HAL_Pin_Map();
            pin_t gpio_pin = PIN_MAP[usartMap[serial]->tx_pin].gpio_pin;
            GPIO_TypeDef *gpio_port = PIN_MAP[usartMap[serial]->tx_pin].gpio_peripheral;
            GPIO_InitTypeDef GPIO_InitStructure = {0};
            GPIO_InitStructure.GPIO_Pin = gpio_pin;
            GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF;
            GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
            GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
            GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
            GPIO_Init(gpio_port, &GPIO_InitStructure);
        }
    }
}

bool hardwareFlowControlSupported(hal_usart_interface_t serial) {
    return (usartMap[serial]->rts_pin != PIN_INVALID) && (usartMap[serial]->cts_pin != PIN_INVALID);
}

void usartEndImpl(hal_usart_interface_t serial, bool end) {
    Hal_Pin_Info* PIN_MAP = HAL_Pin_Map();
    if (usartMap[serial]->conf.config & SERIAL_FLOW_CONTROL_RTS) {
        // nRTS is still under control of USART peripheral, release it.
        GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->rts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->rts_pin].gpio_pin_source, 0/*default after reset*/);
        HAL_Pin_Mode(usartMap[serial]->rts_pin, OUTPUT);
        HAL_GPIO_Write(usartMap[serial]->rts_pin, 1);
    }

    // Wait for transmission of outgoing data
    while (usartMap[serial]->tx_buffer.head != usartMap[serial]->tx_buffer.tail);

    // Disable the USART
    USART_Cmd(usartMap[serial]->peripheral, DISABLE);

    // Disable LIN mode
    USART_LINCmd(usartMap[serial]->peripheral, DISABLE);

    // Deinitialise USART
    USART_DeInit(usartMap[serial]->peripheral);

    // Disable USART Receive and Transmit interrupts
    USART_ITConfig(usartMap[serial]->peripheral, USART_IT_RXNE, DISABLE);
    USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TXE, DISABLE);

    NVIC_InitTypeDef NVIC_InitStructure;

    // Disable the USART Interrupt
    NVIC_InitStructure.NVIC_IRQChannel = usartMap[serial]->int_n;
    NVIC_InitStructure.NVIC_IRQChannelCmd = DISABLE;

    NVIC_Init(&NVIC_InitStructure);

    // Disable USART Clock
    *usartMap[serial]->apb_reg &= ~usartMap[serial]->clock_enabled;

    GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->rx_pin].gpio_peripheral, usartMap[serial]->rx_pinsource, 0);
    GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->tx_pin].gpio_peripheral, usartMap[serial]->tx_pinsource, 0);

    // Switch pins to INPUT
    HAL_Pin_Mode(usartMap[serial]->rx_pin, INPUT);
    HAL_Pin_Mode(usartMap[serial]->tx_pin, end ? INPUT : INPUT_PULLUP);

