particle-iot/device-os/hal/src/stm32f2xx/usart_hal.c
    if (usartMap[serial]->conf.config & SERIAL_FLOW_CONTROL_RTS) {
        // NOTE: AF setting has already been reset above
        HAL_Pin_Mode(usartMap[serial]->rts_pin, end ? INPUT : INPUT_PULLUP);
    }

    if (usartMap[serial]->conf.config & SERIAL_FLOW_CONTROL_CTS) {
        GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->cts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->cts_pin].gpio_pin_source, 0);
        HAL_Pin_Mode(usartMap[serial]->cts_pin, INPUT);
    }
}

int hal_usart_init_ex(hal_usart_interface_t serial, const hal_usart_buffer_config_t* conf, void* reserved) {
    CHECK_TRUE(conf, SYSTEM_ERROR_INVALID_ARGUMENT);

    CHECK_TRUE(conf->rx_buffer, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(conf->rx_buffer_size, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(conf->tx_buffer, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(conf->tx_buffer_size, SYSTEM_ERROR_INVALID_ARGUMENT);

    usartMap[serial]->configured = false;

    if (serial == HAL_USART_SERIAL1) {
        usartMap[serial] = &USART_MAP[USART_TX_RX];
    } else if (serial == HAL_USART_SERIAL2) {
        usartMap[serial] = &USART_MAP[USART_RGBG_RGBB];
    }
#if PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION
    else if (serial == HAL_USART_SERIAL3) {
        usartMap[serial] = &USART_MAP[USART_TXD_UC_RXD_UC];
    } else if (serial == HAL_USART_SERIAL4) {
        usartMap[serial] = &USART_MAP[USART_C3_C2];
    } else if (serial == HAL_USART_SERIAL5) {
        usartMap[serial] = &USART_MAP[USART_C1_C0];
    }
#endif // PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION

    usartMap[serial]->rx_buffer.buffer = conf->rx_buffer;
    usartMap[serial]->rx_buffer.size = conf->rx_buffer_size;
    usartMap[serial]->rx_buffer.buffer_size = conf->rx_buffer_size;
    usartMap[serial]->rx_buffer.head = 0;
    usartMap[serial]->rx_buffer.tail = 0;
    usartMap[serial]->tx_buffer.buffer = conf->tx_buffer;
    usartMap[serial]->tx_buffer.size = conf->tx_buffer_size;
    usartMap[serial]->tx_buffer.buffer_size = conf->tx_buffer_size;
    usartMap[serial]->tx_buffer.head = 0;
    usartMap[serial]->tx_buffer.tail = 0;

    usartMap[serial]->state = HAL_USART_STATE_DISABLED;
    usartMap[serial]->transmitting = false;

    usartMap[serial]->configured = true;
    return 0;
}

void hal_usart_init(hal_usart_interface_t serial, hal_usart_ring_buffer_t *rx_buffer, hal_usart_ring_buffer_t *tx_buffer) {
    hal_usart_buffer_config_t conf = {
        .size = sizeof(hal_usart_buffer_config_t),
        .rx_buffer = rx_buffer->buffer,
        .rx_buffer_size = sizeof(rx_buffer->buffer),
        .tx_buffer = tx_buffer->buffer,
        .tx_buffer_size = sizeof(tx_buffer->buffer)
    };

    hal_usart_init_ex(serial, &conf, NULL);
}

void hal_usart_begin(hal_usart_interface_t serial, uint32_t baud) {
    hal_usart_begin_config(serial, baud, 0, 0); // Default serial configuration is 8N1
}

void hal_usart_begin_config(hal_usart_interface_t serial, uint32_t baud, uint32_t config, void *ptr) {
    if (!usartMap[serial]->configured) {
        return;
    }
    // Verify UART configuration, exit if it's invalid.
    if (!validateConfig(serial, config)) {
        return;
    }

    USART_DeInit(usartMap[serial]->peripheral);
    usartMap[serial]->state = HAL_USART_STATE_DISABLED;

    configurePinsMode(serial, config);

    // Enable USART Clock
    *usartMap[serial]->apb_reg |=  usartMap[serial]->clock_enabled;

    // Connect USART pins to AFx
    Hal_Pin_Info* PIN_MAP = HAL_Pin_Map();
    GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->rx_pin].gpio_peripheral, usartMap[serial]->rx_pinsource, usartMap[serial]->af_map);
    GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->tx_pin].gpio_peripheral, usartMap[serial]->tx_pinsource, usartMap[serial]->af_map);

    // NVIC Configuration
    NVIC_InitTypeDef NVIC_InitStructure;
    // Enable the USART Interrupt
    NVIC_InitStructure.NVIC_IRQChannel = usartMap[serial]->int_n;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 7;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    // USART default configuration
    // USART configured as follow:
    // - BaudRate = (set baudRate as 9600 baud)
    // - Word Length = 8 Bits
    // - One Stop Bit
    // - No parity
    // - Hardware flow control disabled for Serial1/2/4/5
    // - Hardware flow control enabled (RTS and CTS signals) for Serial3
    // - Receive and transmit enabled
    // USART configuration
    usartInitStructure.USART_BaudRate = baud;
    usartInitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;

    // Flow control configuration
    switch (config & SERIAL_FLOW_CONTROL) {
        case SERIAL_FLOW_CONTROL_CTS: {
            usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_CTS;
            break;
        }
        case SERIAL_FLOW_CONTROL_RTS: {
            usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS;
            break;
        }
        case SERIAL_FLOW_CONTROL_RTS_CTS: {
            usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
            break;
        }
        case SERIAL_FLOW_CONTROL_NONE:
        default: {
            usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
            break;
        }
    }

    if (serial == HAL_USART_SERIAL1) {
        // USART1 supports hardware flow control, but RTS and CTS pins are not exposed
        usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    }

#if PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION
    if (serial == HAL_USART_SERIAL4 || serial == HAL_USART_SERIAL5) {
        // UART4 and UART5 do not support hardware flow control
        usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    }
#endif // PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION

#if USE_USART3_HARDWARE_FLOW_CONTROL_RTS_CTS    // Electron
    if (serial == HAL_USART_SERIAL3) {
        usartInitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_RTS_CTS;
    }
#endif

