particle-iot/device-os/hal/src/stm32f2xx/usart_hal.c
    switch (usartInitStructure.USART_HardwareFlowControl) {
        case USART_HardwareFlowControl_CTS: {
            HAL_Pin_Mode(usartMap[serial]->cts_pin, AF_OUTPUT_PUSHPULL);
            GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->cts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->cts_pin].gpio_pin_source, usartMap[serial]->af_map);
            break;
        }
        case USART_HardwareFlowControl_RTS: {
            HAL_Pin_Mode(usartMap[serial]->rts_pin, AF_OUTPUT_PUSHPULL);
            GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->rts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->rts_pin].gpio_pin_source, usartMap[serial]->af_map);
            break;
        }
        case USART_HardwareFlowControl_RTS_CTS: {
            HAL_Pin_Mode(usartMap[serial]->cts_pin, AF_OUTPUT_PUSHPULL);
            HAL_Pin_Mode(usartMap[serial]->rts_pin, AF_OUTPUT_PUSHPULL);
            GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->cts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->cts_pin].gpio_pin_source, usartMap[serial]->af_map);
            GPIO_PinAFConfig(PIN_MAP[usartMap[serial]->rts_pin].gpio_peripheral, PIN_MAP[usartMap[serial]->rts_pin].gpio_pin_source, usartMap[serial]->af_map);
            break;
        }
        case USART_HardwareFlowControl_None:
        default: {
            break;
        }
    }

    // Stop bit configuration.
    switch (config & SERIAL_STOP_BITS) {
        case SERIAL_STOP_BITS_1: { // 1 stop bit
            usartInitStructure.USART_StopBits = USART_StopBits_1;
            break;
        }
        case SERIAL_STOP_BITS_2: { // 2 stop bits
            usartInitStructure.USART_StopBits = USART_StopBits_2;
            break;
        }
        case SERIAL_STOP_BITS_0_5: { // 0.5 stop bits
            usartInitStructure.USART_StopBits = USART_StopBits_0_5;
            break;
        }
        case SERIAL_STOP_BITS_1_5: { // 1.5 stop bits
            usartInitStructure.USART_StopBits = USART_StopBits_1_5;
            break;
        }
        default: {
            break;
        }
    }

    // Data bits configuration
    switch (calculateWordLength(config, 0)) {
        case 8: {
            usartInitStructure.USART_WordLength = USART_WordLength_8b;
            break;
        }
        case 9: {
            usartInitStructure.USART_WordLength = USART_WordLength_9b;
            break;
        }
        default: {
            break;
        }
    }

    // Parity configuration
    switch (config & SERIAL_PARITY) {
        case SERIAL_PARITY_NO: {
            usartInitStructure.USART_Parity = USART_Parity_No;
            break;
        }
        case SERIAL_PARITY_EVEN: {
            usartInitStructure.USART_Parity = USART_Parity_Even;
            break;
        }
        case SERIAL_PARITY_ODD: {
            usartInitStructure.USART_Parity = USART_Parity_Odd;
            break;
        }
        default: {
            break;
        }
    }

    // Disable LIN mode just in case
    USART_LINCmd(usartMap[serial]->peripheral, DISABLE);

    // Configure USART
    USART_Init(usartMap[serial]->peripheral, &usartInitStructure);

    // LIN configuration
    if (config & LIN_MODE) {
        // Enable break detection
        switch (config & LIN_BREAK_BITS) {
            case LIN_BREAK_10B: {
                USART_LINBreakDetectLengthConfig(usartMap[serial]->peripheral, USART_LINBreakDetectLength_10b);
                break;
            }
            case LIN_BREAK_11B: {
                USART_LINBreakDetectLengthConfig(usartMap[serial]->peripheral, USART_LINBreakDetectLength_11b);
                break;
            }
            default: {
                break;
            }
        }
    }

    usartMap[serial]->conf.baud_rate = baud;
    usartMap[serial]->conf.config = config;
    if (config & SERIAL_HALF_DUPLEX) {
        hal_usart_half_duplex(serial, ENABLE);
    }

    USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TC, DISABLE);

    // Enable the USART
    USART_Cmd(usartMap[serial]->peripheral, ENABLE);

    if (config & LIN_MODE) {
        USART_LINCmd(usartMap[serial]->peripheral, ENABLE);
    }

    usartMap[serial]->state = HAL_USART_STATE_ENABLED;
    usartMap[serial]->transmitting = false;

    if (calculateWordLength(config, 1) <= 8) {
        usartMap[serial]->rx_buffer.size = usartMap[serial]->rx_buffer.buffer_size;
        usartMap[serial]->tx_buffer.size = usartMap[serial]->tx_buffer.buffer_size;
    } else {
        usartMap[serial]->rx_buffer.size = usartMap[serial]->rx_buffer.buffer_size / 2;
        usartMap[serial]->tx_buffer.size = usartMap[serial]->tx_buffer.buffer_size / 2;
    }

    // These should already be correctly initialized by hal_usart_init_ex or reset by hal_usart_end()
    // usartMap[serial]->rx_buffer.head = usartMap[serial]->rx_buffer.tail = 0;
    // usartMap[serial]->tx_buffer.head = usartMap[serial]->tx_buffer.tail = 0;

    // Enable USART Receive and Transmit interrupts
    USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TXE, ENABLE);
    USART_ITConfig(usartMap[serial]->peripheral, USART_IT_RXNE, ENABLE);
}

void hal_usart_end(hal_usart_interface_t serial) {
    if (usartMap[serial]->state == HAL_USART_STATE_DISABLED) {
        // Invalid state
        return;
    }
    usartEndImpl(serial, true);

    // clear any received data
    usartMap[serial]->rx_buffer.head = usartMap[serial]->rx_buffer.tail = 0;
    usartMap[serial]->tx_buffer.head = usartMap[serial]->tx_buffer.tail = 0;

    usartMap[serial]->state = HAL_USART_STATE_DISABLED;
    usartMap[serial]->transmitting = false;
    usartMap[serial]->conf.baud_rate = 0;
    usartMap[serial]->conf.config = 0;
}

uint32_t hal_usart_write(hal_usart_interface_t serial, uint8_t data) {
    return hal_usart_write_nine_bits(serial, data);
}

uint32_t hal_usart_write_nine_bits(hal_usart_interface_t serial, uint16_t data) {
    // Remove any bits exceeding data bits configured
    data &= calculateDataBitsMask(usartMap[serial]->conf.config);
    // interrupts are off and data in queue;
    if ((USART_GetITStatus(usartMap[serial]->peripheral, USART_IT_TXE) == RESET)
        && usartMap[serial]->tx_buffer.head != usartMap[serial]->tx_buffer.tail) {
        // Get him busy
        USART_ITConfig(usartMap[serial]->peripheral, USART_IT_TXE, ENABLE);
    }

    unsigned i = (usartMap[serial]->tx_buffer.head + 1) % usartMap[serial]->tx_buffer.size;

